Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM6408PL10048.svd
               <register>
                  <name>DIRSET</name>
                  <description>Data Direction Set</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>DIR0SET</name>
                        <description>Port Data Direction 0 Set</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR1SET</name>
                        <description>Port Data Direction 1 Set</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR2SET</name>
                        <description>Port Data Direction 2 Set</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR3SET</name>
                        <description>Port Data Direction 3 Set</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR4SET</name>
                        <description>Port Data Direction 4 Set</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR5SET</name>
                        <description>Port Data Direction 5 Set</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR6SET</name>
                        <description>Port Data Direction 6 Set</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR7SET</name>
                        <description>Port Data Direction 7 Set</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR8SET</name>
                        <description>Port Data Direction 8 Set</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR9SET</name>
                        <description>Port Data Direction 9 Set</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR10SET</name>
                        <description>Port Data Direction 10 Set</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR11SET</name>
                        <description>Port Data Direction 11 Set</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR12SET</name>
                        <description>Port Data Direction 12 Set</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR13SET</name>
                        <description>Port Data Direction 13 Set</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR14SET</name>
                        <description>Port Data Direction 14 Set</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR15SET</name>
                        <description>Port Data Direction 15 Set</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR16SET</name>
                        <description>Port Data Direction 16 Set</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR17SET</name>
                        <description>Port Data Direction 17 Set</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR18SET</name>
                        <description>Port Data Direction 18 Set</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR19SET</name>
                        <description>Port Data Direction 19 Set</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR20SET</name>
                        <description>Port Data Direction 20 Set</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR21SET</name>
                        <description>Port Data Direction 21 Set</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR22SET</name>
                        <description>Port Data Direction 22 Set</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR23SET</name>
                        <description>Port Data Direction 23 Set</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR24SET</name>
                        <description>Port Data Direction 24 Set</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR25SET</name>
                        <description>Port Data Direction 25 Set</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR26SET</name>
                        <description>Port Data Direction 26 Set</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR27SET</name>
                        <description>Port Data Direction 27 Set</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR28SET</name>
                        <description>Port Data Direction 28 Set</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR29SET</name>
                        <description>Port Data Direction 29 Set</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR30SET</name>
                        <description>Port Data Direction 30 Set</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR31SET</name>
                        <description>Port Data Direction 31 Set</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DIRTGL</name>
                  <description>Data Direction Toggle</description>
                  <addressOffset>0xC</addressOffset>
                  <fields>
                     <field>
                        <name>DIR0TGL</name>
                        <description>Port Data Direction 0 Toggle</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR1TGL</name>
                        <description>Port Data Direction 1 Toggle</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR2TGL</name>
                        <description>Port Data Direction 2 Toggle</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR3TGL</name>
                        <description>Port Data Direction 3 Toggle</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR4TGL</name>
                        <description>Port Data Direction 4 Toggle</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR5TGL</name>
                        <description>Port Data Direction 5 Toggle</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR6TGL</name>
                        <description>Port Data Direction 6 Toggle</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR7TGL</name>
                        <description>Port Data Direction 7 Toggle</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR8TGL</name>
                        <description>Port Data Direction 8 Toggle</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR9TGL</name>
                        <description>Port Data Direction 9 Toggle</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR10TGL</name>
                        <description>Port Data Direction 10 Toggle</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR11TGL</name>
                        <description>Port Data Direction 11 Toggle</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR12TGL</name>
                        <description>Port Data Direction 12 Toggle</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR13TGL</name>
                        <description>Port Data Direction 13 Toggle</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR14TGL</name>
                        <description>Port Data Direction 14 Toggle</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR15TGL</name>
                        <description>Port Data Direction 15 Toggle</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR16TGL</name>
                        <description>Port Data Direction 16 Toggle</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR17TGL</name>
                        <description>Port Data Direction 17 Toggle</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR18TGL</name>
                        <description>Port Data Direction 18 Toggle</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR19TGL</name>
                        <description>Port Data Direction 19 Toggle</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR20TGL</name>
                        <description>Port Data Direction 20 Toggle</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR21TGL</name>
                        <description>Port Data Direction 21 Toggle</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR22TGL</name>
                        <description>Port Data Direction 22 Toggle</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR23TGL</name>
                        <description>Port Data Direction 23 Toggle</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR24TGL</name>
                        <description>Port Data Direction 24 Toggle</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR25TGL</name>
                        <description>Port Data Direction 25 Toggle</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR26TGL</name>
                        <description>Port Data Direction 26 Toggle</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR27TGL</name>
                        <description>Port Data Direction 27 Toggle</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR28TGL</name>
                        <description>Port Data Direction 28 Toggle</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR29TGL</name>
                        <description>Port Data Direction 29 Toggle</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR30TGL</name>
                        <description>Port Data Direction 30 Toggle</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR31TGL</name>
                        <description>Port Data Direction 31 Toggle</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
