Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM6408PL10048.svd
               <register>
                  <name>IN</name>
                  <description>Data Input Value</description>
                  <addressOffset>0x20</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>IN0</name>
                        <description>PORT Data Input Value 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN1</name>
                        <description>PORT Data Input Value 1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN2</name>
                        <description>PORT Data Input Value 2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN3</name>
                        <description>PORT Data Input Value 3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN4</name>
                        <description>PORT Data Input Value 4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN5</name>
                        <description>PORT Data Input Value 5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN6</name>
                        <description>PORT Data Input Value 6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN7</name>
                        <description>PORT Data Input Value 7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN8</name>
                        <description>PORT Data Input Value 8</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN9</name>
                        <description>PORT Data Input Value 9</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN10</name>
                        <description>PORT Data Input Value 10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN11</name>
                        <description>PORT Data Input Value 11</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN12</name>
                        <description>PORT Data Input Value 12</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN13</name>
                        <description>PORT Data Input Value 13</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN14</name>
                        <description>PORT Data Input Value 14</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN15</name>
                        <description>PORT Data Input Value 15</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN16</name>
                        <description>PORT Data Input Value 16</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN17</name>
                        <description>PORT Data Input Value 17</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN18</name>
                        <description>PORT Data Input Value 18</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN19</name>
                        <description>PORT Data Input Value 19</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN20</name>
                        <description>PORT Data Input Value 20</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN21</name>
                        <description>PORT Data Input Value 21</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN22</name>
                        <description>PORT Data Input Value 22</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN23</name>
                        <description>PORT Data Input Value 23</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN24</name>
                        <description>PORT Data Input Value 24</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN25</name>
                        <description>PORT Data Input Value 25</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN26</name>
                        <description>PORT Data Input Value 26</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN27</name>
                        <description>PORT Data Input Value 27</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN28</name>
                        <description>PORT Data Input Value 28</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN29</name>
                        <description>PORT Data Input Value 29</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN30</name>
                        <description>PORT Data Input Value 30</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IN31</name>
                        <description>PORT Data Input Value 31</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRL</name>
                  <description>Control</description>
                  <addressOffset>0x24</addressOffset>
                  <fields>
                     <field>
                        <name>SAMPLING0</name>
                        <description>Input Sampling Mode 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING1</name>
                        <description>Input Sampling Mode 1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING2</name>
                        <description>Input Sampling Mode 2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING3</name>
                        <description>Input Sampling Mode 3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING4</name>
                        <description>Input Sampling Mode 4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING5</name>
                        <description>Input Sampling Mode 5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING6</name>
                        <description>Input Sampling Mode 6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING7</name>
                        <description>Input Sampling Mode 7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING8</name>
                        <description>Input Sampling Mode 8</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING9</name>
                        <description>Input Sampling Mode 9</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING10</name>
                        <description>Input Sampling Mode 10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING11</name>
                        <description>Input Sampling Mode 11</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING12</name>
                        <description>Input Sampling Mode 12</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING13</name>
                        <description>Input Sampling Mode 13</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING14</name>
                        <description>Input Sampling Mode 14</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING15</name>
                        <description>Input Sampling Mode 15</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING16</name>
                        <description>Input Sampling Mode 16</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING17</name>
                        <description>Input Sampling Mode 17</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING18</name>
                        <description>Input Sampling Mode 18</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING19</name>
                        <description>Input Sampling Mode 19</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING20</name>
                        <description>Input Sampling Mode 20</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING21</name>
                        <description>Input Sampling Mode 21</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING22</name>
                        <description>Input Sampling Mode 22</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING23</name>
                        <description>Input Sampling Mode 23</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING24</name>
                        <description>Input Sampling Mode 24</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING25</name>
                        <description>Input Sampling Mode 25</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING26</name>
                        <description>Input Sampling Mode 26</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING27</name>
                        <description>Input Sampling Mode 27</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING28</name>
                        <description>Input Sampling Mode 28</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING29</name>
                        <description>Input Sampling Mode 29</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING30</name>
                        <description>Input Sampling Mode 30</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAMPLING31</name>
                        <description>Input Sampling Mode 31</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WRCONFIG</name>
                  <description>Write Configuration</description>
                  <addressOffset>0x28</addressOffset>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>PINMASK</name>
                        <description>Pin Mask for Multiple Pin Configuration</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>PMUXEN</name>
                        <description>Peripheral Multiplexer Enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INEN</name>
                        <description>Input Enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PULLEN</name>
                        <description>Pull Enable</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SLEWLIM</name>
                        <description>Output Driver Slew Rate Limit Enable</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PMUX</name>
                        <description>Peripheral Multiplexing</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>PMUXSelect</name>
                           <enumeratedValue>
                              <name>A</name>
                              <description>Peripheral function A selected</description>
                              <value>0x00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>B</name>
                              <description>Peripheral function B selected</description>
                              <value>0x01</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>C</name>
                              <description>Peripheral function C selected</description>
                              <value>0x02</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>D</name>
                              <description>Peripheral function D selected</description>
                              <value>0x03</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>E</name>
                              <description>Peripheral function E selected</description>
                              <value>0x04</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>F</name>
                              <description>Peripheral function F selected</description>
                              <value>0x05</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>G</name>
                              <description>Peripheral function G selected</description>
                              <value>0x06</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>H</name>
                              <description>Peripheral function H selected</description>
                              <value>0x07</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I</name>
                              <description>Peripheral function I selected</description>
                              <value>0x08</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>J</name>
                              <description>Peripheral function J selected</description>
                              <value>0x09</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>WRPMUX</name>
                        <description>Write PMUX</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WRPINCFG</name>
                        <description>Write PINCFG</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HWSEL</name>
                        <description>Half-Word Select</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
