Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM6408PL10048.svd
               <register>
                  <dim>16</dim>
                  <dimIncrement>1</dimIncrement>
                  <name>PMUX[%s]</name>
                  <description>Peripheral Multiplexing #</description>
                  <addressOffset>0x30</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>PMUXE</name>
                        <description>Peripheral Multiplexing for Even-Numbered Pin</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>PMUXESelect</name>
                           <enumeratedValue>
                              <name>A</name>
                              <description>Peripheral function A selected</description>
                              <value>0x00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>B</name>
                              <description>Peripheral function B selected</description>
                              <value>0x01</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>C</name>
                              <description>Peripheral function C selected</description>
                              <value>0x02</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>D</name>
                              <description>Peripheral function D selected</description>
                              <value>0x03</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>E</name>
                              <description>Peripheral function E selected</description>
                              <value>0x04</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>F</name>
                              <description>Peripheral function F selected</description>
                              <value>0x05</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>G</name>
                              <description>Peripheral function G selected</description>
                              <value>0x06</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>H</name>
                              <description>Peripheral function H selected</description>
                              <value>0x07</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I</name>
                              <description>Peripheral function I selected</description>
                              <value>0x08</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>J</name>
                              <description>Peripheral function J selected</description>
                              <value>0x09</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PMUXO</name>
                        <description>Peripheral Multiplexing for Odd-Numbered Pin</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>PMUXOSelect</name>
                           <enumeratedValue>
                              <name>A</name>
                              <description>Peripheral function A selected</description>
                              <value>0x00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>B</name>
                              <description>Peripheral function B selected</description>
                              <value>0x01</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>C</name>
                              <description>Peripheral function C selected</description>
                              <value>0x02</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>D</name>
                              <description>Peripheral function D selected</description>
                              <value>0x03</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>E</name>
                              <description>Peripheral function E selected</description>
                              <value>0x04</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>F</name>
                              <description>Peripheral function F selected</description>
                              <value>0x05</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>G</name>
                              <description>Peripheral function G selected</description>
                              <value>0x06</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>H</name>
                              <description>Peripheral function H selected</description>
                              <value>0x07</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I</name>
                              <description>Peripheral function I selected</description>
                              <value>0x08</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>J</name>
                              <description>Peripheral function J selected</description>
                              <value>0x09</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>32</dim>
                  <dimIncrement>1</dimIncrement>
                  <name>PINCFG[%s]</name>
                  <description>Pin Configuration #</description>
                  <addressOffset>0x40</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>PMUXEN</name>
                        <description>Peripheral Multiplexer Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INEN</name>
                        <description>Input Buffer Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PULLEN</name>
                        <description>Pull Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SLEWLIM</name>
                        <description>Output Driver Slew Rate Limit Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
