Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM6408PL10048.svd
               <register>
                  <name>ALARM0</name>
                  <description>MODE2 Alarm 0 Value</description>
                  <addressOffset>0x20</addressOffset>
                  <fields>
                     <field>
                        <name>SECOND</name>
                        <description>Second</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>MINUTE</name>
                        <description>Minute</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>DAY</name>
                        <description>Day</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>MONTH</name>
                        <description>Month</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>4</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>MONTHSelect</name>
                           <enumeratedValue>
                              <name>JAN</name>
                              <description>January</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FEB</name>
                              <description>February</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MAR</name>
                              <description>March</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>APR</name>
                              <description>April</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MAY</name>
                              <description>May</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>JUN</name>
                              <description>June</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>JUL</name>
                              <description>July</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AUG</name>
                              <description>August</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SEP</name>
                              <description>September</description>
                              <value>0x9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>OCT</name>
                              <description>October</description>
                              <value>0xA</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NOV</name>
                              <description>November</description>
                              <value>0xB</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DEC</name>
                              <description>December</description>
                              <value>0xC</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>YEAR</name>
                        <description>Year</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ALARM0_CLK12H_MODE</name>
                  <description>MODE2 Alarm 0 Value</description>
                  <alternateRegister>ALARM0</alternateRegister>
                  <addressOffset>0x20</addressOffset>
                  <fields>
                     <field>
                        <name>HOUR</name>
                        <description>Hour</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>INDICATOR</name>
                        <description>Meridiem Indicator</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>INDICATORSelect</name>
                           <enumeratedValue>
                              <name>AM</name>
                              <description>Before midday (AM)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PM</name>
                              <description>After midday (PM)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ALARM0_CLK24H_MODE</name>
                  <description>MODE2 Alarm 0 Value</description>
                  <alternateRegister>ALARM0</alternateRegister>
                  <addressOffset>0x20</addressOffset>
                  <fields>
                     <field>
                        <name>HOUR</name>
                        <description>Hour</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MASK0</name>
                  <description>MODE2 Alarm 0 Mask</description>
                  <addressOffset>0x24</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>SEL</name>
                        <description>Alarm Mask Selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>SELSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>Alarm Disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SS</name>
                              <description>Match seconds only</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MMSS</name>
                              <description>Match seconds and minutes only</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HHMMSS</name>
                              <description>Match seconds, minutes, and hours only</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DDHHMMSS</name>
                              <description>Match seconds, minutes, hours, and days only</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MMDDHHMMSS</name>
                              <description>Match seconds, minutes, hours, days, and months only</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>YYMMDDHHMMSS</name>
                              <description>Match seconds, minutes, hours, days, months, and years</description>
                              <value>0x6</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
